Console.Clear();
/*Задача 13: Напишите программу, которая выводит третью цифру(c начала) заданного числа
 или сообщает, что третьей цифры нет.
НЕ ИСПОЛЬЗОВАТЬ НУМЕРАЦИЮ СТРОК
645 -> 5

78 -> третьей цифры нет

32679 -> 6
*/
Console.WriteLine("Please, write here your number: ");
int a = Convert.ToInt32(Console.ReadLine());
    if(a < 100)
Console.WriteLine("there is no third numeral!");//не уверенна в правильной англ грамматике
    else if (a > 99 && a < 1000)
{
int a3 = a % 10;//если число имеет 3 цифры работает, иначе находит последнюю цифру
Console.WriteLine(a3);
}
int [] length = {length};
length[0] = 
   while(a > 999 && a < length)
{
    if(int а4  = a / 10;
int a5 = a4 % 10;
}
Console.WriteLine(a5);

System.Console.WriteLine(   );





